[
  {
    "position": "Product Design Lead",
    "company": "Wayfair",
    "link": "https://www.wayfair.com/",
    "years": "2022–2025",
    "description": "Designed core supplier logistics experiences, working across the full UX/UI cycle\n    for solutions in order creation, management, inventory, and supplier reporting,\n    especially leading design for inventory management workflows. Collaborated with Product, Engineering, and Research\n    teams to refine shared design patterns and contribute to the ongoing development of the Partner Home Core Design System.\n    Conducted comprehensive research with suppliers; distilled insights from both user interviews and data,\n    translating them into actionable product improvements.Supported process improvements in team documentation, onboarding,\n    workflow, and interdepartmental communication by applying design thinking and knowledge-sharing practices."
  },
  
  {
    "position": "Senior UX/UI Designer",
    "company": "BuildingMinds by Schindler Group",
    "link": "https://buildingminds.com/",
    "years": "2019–2021",
    "description": "Directed end-to-end UX design process, significantly improving user satisfaction (NPS).\nEstablished comprehensive Design System streamlining development processes.\nCo-founded \"App Factory\" an initiative integrating Research, Design, Product, and Technology.\nOptimized data onboarding workflows improving user adoption and integration efficiency."
  },
  
  {
    "position": "Senior UX Designer",
    "company": "SAP Signavio",
    "link": "https://www.signavio.com/",
    "years": "2018-2019",
    "description": "Established and managed Signavio’s company-wide design library, driving consistency\n    and collaboration across product teams. Led UX/UI redesign and integration of the company’s flagship product,\n    elevating user experience and unifying visual standards. Delivered high-impact flow sketches, wireframes,\n    interactive prototypes, and usability tests."
  },
  
  {
    "position": "Creative Director",
    "company": "Safebreach",
    "link": "https://www.safebreach.com/",
    "years": "2015–2017",
    "description": "Sole designer from company inception, overseeing all aspects of UX/UI, branding,\n    merchandise, marketing, and event visuals for three years. Implemented full design thinking process\n    and delivered UX documentation and impactful design assets supporting product development and sales."
  },
    {
    "position": "Early Career Highlights",
    "company": "Sandisk, Stanley Black & Decker, Aran R&D (HP), Ola Mundo",
    "link": "-",
    "years": "2005–2015",
    "description": "Delivered visual and interface design for international hardware and software products.\n    Led cross-functional projects covering packaging, interface systems, and product visuals,\n    ensuring brand consistency and usability across multiple markets.\n    Collaborated with global development teams to maintain high UX standards and align design with manufacturing and marketing goals."
  }
]
